{"data":{"contentfulExperience":{"experience":[{"sectionContent":{"sectionContent":"<p class=\"experience\">\n  <i class=\"fa fa-angle-right\"></i> Frontend: HTML, Sightly, SCSS, LESS, JS, GatsbyJS, NEXTJS, ReactJS, GraphQL, JSON, XML, Liquid\n\t<br/><i class=\"fa fa-angle-right\"></i> Devops: GaugeJS, Storybook, JestSnapshots, NextJS Export, JIRA, BitBucket, Confluence\n  <br/><i class=\"fa fa-angle-right\"></i> CMS: AEM6.3, AEM6.5, Shopify\n</p>"},"company":"The Wonderful Company","datePosition":"October 2018 - Present | Frontend Engineer"},{"sectionContent":{"sectionContent":"<p class=\"experience\">\n\t<i class=\"fa fa-angle-right\"></i> Developed pixel perfect responsive websites using PSDs given from designers and expedited the build on WordPress and Magento CMS platforms using HTML, SCSS/LESS, PHP, JavaScript, jQuery, AJAX and JSON data.<br/>\n\t<i class=\"fa fa-angle-right\"></i> Integrated countless websites with 3rd party API’s such as PayPal, Authorize.NET, Shipping Easy, Instagram, Facebook, Google Web Master Tools, Power Reviews, etc.<br/>\n\t<i class=\"fa fa-angle-right\"></i> Worked with designers, project managers, sales and other developers to optimize research and development process.<br/>\n\t<i class=\"fa fa-angle-right\"></i> Setup domain, hosting and deployed countless websites using SSH, FTP and cPanel.<br/>\n\t<i class=\"fa fa-angle-right\"></i> Managed many repositories and source code using Git, Source Tree and Bit Bucket.<br/>\n\t<i class=\"fa fa-angle-right\"></i> Worked closely with Adobe’s HelpX team to rebuild their support pages under SCRUM methodology using Sightly, JS, AJAX, JSON, HTML, SASS and Java.<br/>\n\t<i class=\"fa fa-angle-right\"></i> Work with local, dev, QA, staging and live environments.<br/>\n\t<i class=\"fa fa-angle-right\"></i> Transformed over 50 custom different designs into fully responsive functional websites and launched them into production.<br/>\n\t<i class=\"fa fa-angle-right\"></i> Oversaw junior developers, development interns and overseas developers to ensure that they have all the necessary assets to complete tasks with given deadlines.<br/>\n\t<i class=\"fa fa-angle-right\"></i> Perform code reviews along side senior developers to ensure code quality.\n</p>"},"company":"Ready Artwork","datePosition":"July 2015 - June 2018 | Web Developer / Team Lead"},{"sectionContent":{"sectionContent":"<p class=\"experience\">\n\t\t<span><a href=\"https://www.jasonyangdev.com\"><strong>www.jasonyangdev.com</strong></a> - 2020</span>\n    <br><i class=\"fa fa-angle-right\"></i> GatsbyJS portfolio that sources content from Contentful and implements styled components as well as ThreeJS libraries for nifty backgrounds.\n    <br><i class=\"fa fa-angle-right\"></i> Migrated hosting onto Google Cloud Storage and setup GSUTILS to improve deployment processes and cut down costs\n    <br>\n    <br><span><a href=\"https://am-dd.com/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\"><strong>am-dd.com</strong></a> - 2018</span>\n    <br><i class=\"fa fa-angle-right\"></i> Communicate closely with owner of American Design & Development(am-dd) to expedite the build client's new site.\n    <br><i class=\"fa fa-angle-right\"></i> Lead the development of custom theme integration and development for WordPress site.\n    <br><i class=\"fa fa-angle-right\"></i> Handled the database migration and ensure no content was lost as their old site was still being used during the process.\n    <br><i class=\"fa fa-angle-right\"></i> Managed source code using Git and deploy code using wpengine & Git.\n    <br>\n    <br><span><strong>surf.live</strong> - 2018</span>\n    <br><i class=\"fa fa-angle-right\"></i> Worked along side web designers and VP of engineering to deliver a website in an extremely tight deadline.\n    <br><i class=\"fa fa-angle-right\"></i> Collaborated with developers and designs to build/debug different segments as well as deploy the site into production.\n    <br><i class=\"fa fa-angle-right\"></i> Built as a codepen project using PUG(jade), SCSS and JS.\n    <br>\n    <br><span><strong>www.jlsmartbets.com</strong> - 2018</span>\n    <br><i class=\"fa fa-angle-right\"></i> Leveraged WordPress and WooCommerce to build a custom site that has a shopping cart and handles restricting content via memberships.\n    <br><i class=\"fa fa-angle-right\"></i> Built as a custom wordpress theme using HTML, SCSS, PHP and jQuery\n    <br>\n    <br><span><a href=\"https://www.jasonyangdev.com\"><strong>www.jasonyangdev.com</strong></a> - 2017</span>\n    <br><i class=\"fa fa-angle-right\"></i> React JS portfolio that consumes API’s from different endpoints to display dynamic data.\n    <br><i class=\"fa fa-angle-right\"></i> Applied materialistic design philosophies and built out unique components including a bill splitter, Giphy search box, latest LA weather forecast and a latest movies component.\n    <br><i class=\"fa fa-angle-right\"></i> Also used this as an opportunity to dabble more into DevOps by setting up NPM DPLOY to enhance efficiency and deployment of code changes. \n    <br><i class=\"fa fa-angle-right\"></i> Built this portfolio using HTML, SCSS and React\n    <br>\n    <br><span><a href=\"http://www.cutlabhairstudio.com\" target=\"_blank\" rel=\"noopener noreferrer nofollow\"><strong>www.cutlabhairstudio.com</strong></a> - 2015</span>\n    <br><i class=\"fa fa-angle-right\"></i> Fully redeveloped the website into a response website geared towards serving almost all content on a single digestable page.\n    <br><i class=\"fa fa-angle-right\"></i> Responsible for everything from wire framing, content strategy, design, development and communication.\n    <br>\n    <br>\n</p>"},"company":"Contractor","datePosition":"Jan 2015 - May 2020 | Web Developer"},{"sectionContent":{"sectionContent":"<p class=\"experience\">\n\t<i class=\"fa fa-angle-right\"></i> Responsible for testing and quality assurance of all SpiritClips applications which includes xBox, Roku and various platforms of iOS and Android.\n   <br><i class=\"fa fa-angle-right\"></i> Managed source code with GitHub.\n   <br><i class=\"fa fa-angle-right\"></i> Assisted in the development of the android app for Samsung TV.\n   <br><i class=\"fa fa-angle-right\"></i> Assisted the content production department with updating the movie information.\n   <br><i class=\"fa fa-angle-right\"></i> Provided assistance with the analysis of competitive market research.\n</p>"},"company":"Spirit Clips (HMnow) by Hallmark","datePosition":"Dec 2013 - Mar 2014 | Tech Intern"}],"sectionTitle":"Experience"}}}